УчетВУправляющихДляГит1/src/Catalogs/КлассификаторПродукцииПоВидамДеятельности/КлассификаторПродукцииПоВидамДеятельности.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>КлассификаторПродукцииПоВидамДеятельности</name>
  <predefined>
    <items>
      <name>РозницаВсего</name>
      <description>Всего по розничной торговле</description>
    </items>
  </predefined>
  <attributes>
    <name>НаименованиеПолное</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаСтатистическогоУчета</name>
    <type>
      <types>CatalogRef.КлассификаторЕдиницИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидСвободныхСтрокФормСтатистики</name>
    <type>
      <types>EnumRef.ВидыСвободныхСтрокФормСтатистики</types>
    </type>
  </attributes>
</mdclass:Catalog>

УчетВУправляющихДляГит1/src/Enums/ВидыСвободныхСтрокФормСтатистики/ВидыСвободныхСтрокФормСтатистики.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыСвободныхСтрокФормСтатистики</name>
  <enumValues>
    <name>ВидыДеятельности</name>
  </enumValues>
  <enumValues>
    <name>ВидыПродукцииОпт</name>
  </enumValues>
  <enumValues>
    <name>ВидыПродукцииПроизводство</name>
  </enumValues>
  <enumValues>
    <name>ВидыПродукцииРозница</name>
  </enumValues>
  <enumValues>
    <name>УслугиНаселению</name>
  </enumValues>
  <enumValues>
    <name>ВидыДеятельностиИП</name>
  </enumValues>
  <enumValues>
    <name>ВидыУслугРозница</name>
  </enumValues>
</mdclass:Enum>

УчетВУправляющихДляГит1/src/Catalogs/КлассификаторПродукцииПоВидамДеятельности/Forms/ФормаСписка/Module.bsl
////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ
//

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Элементы.Список.РежимВыбора = Параметры.РежимВыбора;

КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

&НаКлиенте
Процедура ПодобратьИзКлассификатора(Команда)
	
	ПараметрыФормы = Новый Структура();
	ПараметрыФормы.Вставить("Назначение", ПредопределенноеЗначение("Перечисление.ВидыСвободныхСтрокФормСтатистики.ВидыПродукцииОпт")); 
	ПараметрыФормы.Вставить("Подбор", Истина); 
	
	ОткрытьФорму("ОбщаяФорма.ДобавлениеЭлементовВКлассификатор", ПараметрыФормы, ЭтаФорма);
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

&НаКлиенте
Процедура ВопросЗавершение(Результат, ДополнительныеПараметры) Экспорт

	Если Результат = КодВозвратаДиалога.Да Тогда
		ПараметрыФормы = Новый Структура();
		ПараметрыФормы.Вставить("Назначение", ПредопределенноеЗначение("Перечисление.ВидыСвободныхСтрокФормСтатистики.ВидыПродукцииОпт")); 
		ПараметрыФормы.Вставить("Подбор", Истина); 

		ОткрытьФорму("ОбщаяФорма.ДобавлениеЭлементовВКлассификатор", ПараметрыФормы, ЭтаФорма);
	Иначе
		ПараметрыФормы = Новый Структура("ЗначенияЗаполнения", ДополнительныеПараметры);
		ОткрытьФорму("Справочник.КлассификаторПродукцииПоВидамДеятельности.ФормаОбъекта", ПараметрыФормы, ЭтаФорма);
	КонецЕсли;

КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ТАБЛИЦЫ ФОРМЫ Список
//

&НаКлиенте
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	
	Отказ = Истина;
	
	ТекДанные = Элементы.Список.ТекущиеДанные;
	ДополнительныеПараметры = Новый Структура;
	Если Копирование Тогда
		ДополнительныеПараметры.Вставить("Наименование", ТекДанные.Наименование);
		ДополнительныеПараметры.Вставить("Код", ТекДанные.Код);
		ДополнительныеПараметры.Вставить("НаименованиеПолное", ТекДанные.НаименованиеПолное);
		ДополнительныеПараметры.Вставить("ЕдиницаСтатистическогоУчета", ТекДанные.ЕдиницаСтатистическогоУчета);
		ДополнительныеПараметры.Вставить("ВидСвободныхСтрокФормСтатистики", ТекДанные.ВидСвободныхСтрокФормСтатистики);
	КонецЕсли;
	
	Оповещение = Новый ОписаниеОповещения("ВопросЗавершение", ЭтотОбъект, ДополнительныеПараметры);
	
	ТекстВопроса = НСтр("ru='Есть возможность подобрать продукцию по видам деятельности из классификатора (ОКПД).
		|Подобрать?'");
	ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Нет);
	
КонецПроцедуры
